app/views/movies/index.html.erb

    <tr>
      <th><%= link_to "Movie Title", movies_path({:home => 1, :sort => "title", :ratings => Hash[@ratings_to_show.map {|x| [x, 1]}] }), :class =>("p-3 mb-2 bg-warning text-dark hilite" if @sort == "title"), :id => "title_header"  %></th>
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')  ORDER BY #<ActionDispatch::Request::Session:0x00007ff62dcc95e0>