app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')  ORDER BY #<ActionDispatch::Request::Session:0x00007ff62dcc95e0>
---
    def index
      @all_ratings = Movie.all_ratings
      if params[:ratings] != nil
        @ratings_to_show = params[:ratings].keys
      elsif session[:ratings] != nil
        @ratings_to_show = session[:ratings]
        redirect_to movies_path({:ratings => Hash[@ratings_to_show.map {|x| [x, 1]}], :sort => session[:sort]})
        return
      else
        @ratings_to_show = @all_ratings
      end

      if params[:sort] != nil
        @sort = params[:sort]
      elsif session[:sort] != nil
        redirect_to movies_path({:ratings => Hash[@ratings_to_show.map {|x| [x, 1]}], :sort => session[:sort]})
        return
      else
        @sort = nil
      end

      if @sort != nil
        @movies = Movie.with_ratings(@ratings_to_show).order(@sort)